Revit 2015 API
IFCAnyHandle.SetAttribute Method (String, ICollection<Double>)
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015. Use SetAttribute(string, IList<double>) or SetAttribute(string, ISet<double>) instead.")]
public void SetAttribute(
	string name,
	ICollection<double> values
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015. Use SetAttribute(string, IList<double>) or SetAttribute(string, ISet<double>) instead.")> _
Public Sub SetAttribute ( _
	name As String, _
	values As ICollection(Of Double) _
)
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015. Use SetAttribute(string, IList<double>) or SetAttribute(string, ISet<double>) instead.")]
public:
void SetAttribute(
	String^ name,
	ICollection<double>^ values
)
Parameters
name
Type: System.String
values
Type: System.Collections.Generic.ICollection<Double>
See Also
IFCAnyHandle Class
SetAttribute Overload
Autodesk.Revit.DB.IFC Namespace